# 1. Напишите программу, которая принимает на вход вещественное
# число и показывает сумму его цифр
#
# n = float(input('n= '))
# n_str = str(n)
# len_of_numbers = len(n_str)
# resule = n * 10 ** (len_of_numbers-1)
# count = 0
# while resule > 0:
#     count = count + resule % 10
#     resule = resule//10
# print(count, resule)



