# Задача 2
# def sumofthree(n):
#     summa = 0
#     while n > 0:
#         summa = summa + (n % 10)
#         n = n // 10
#     return summa
# print(sumofthree(345))

# Задача 4
# n = int(input(print("Сколько всего журавликов?")))
# x1 = n//6
# x2 =x1*4
# print(x1, x2, x1)

# Задача  6
# n = int(input(print("Какой номер билета?")))
# def sumofthree(n):
#     summa = 0
#     while n > 0:
#         summa = summa + (n % 10)
#         n = n // 10
#     return summa
#
# if n > 999999 or n<100000:
#     print('Вы ввели неверный номер билета')
# else:
#     firstpart = n%1000
#     secondpart = n//1000
#     if sumofthree(firstpart) == sumofthree(secondpart):
#         print('yes')
#     else:
#         print('no')

# Задача 8
# n = int(input(print("Сколько долек в длину?")))
# m = int(input(print("Сколько долек в ширину?")))
# max=0
# if n>=m:
#     max = n
# else:
#     max=m
# k = int(input(print("Сколько долек вы хотите отломить?")))
# if k > m*n:
#     print('Столько долек в шоколадке  нет;(')
# elif k == m*n:
#     print('Забирай всю')
# elif k%2 != 0:
#     print('Не получится(')
# elif k> max:
#     print('не получается(')
# else:
#     print('получится!')



