# Задача 2
# n = int(input(print("Введите трехзначное число")))
# summa = 0
# while n > 10:
#     summa = summa + (n % 10)
#     n = n // 10
# print('сумма цифр равна', summa )

# Задача 4


n = int(input(print("Сколько всего журавликов?")))
x1 = n//3
x2 =x1*2
x1 = x1//2
print(x1, x2, x1)

